HorseMa/contiki/examples/stm8l/hmc5983&zm516x/STM8L15x_StdPeriph_Template/main.c
/**
  ******************************************************************************
  * @file    Project/STM8L15x_StdPeriph_Template/main.c
  * @author  MCD Application Team
  * @version V1.6.1
  * @date    30-September-2014
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8l15x.h"
#include "contiki.h"
#include "contiki-lib.h"
#include "button-sensor.h"
#include <intrinsics.h>
/** @addtogroup STM8L15x_StdPeriph_Template
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#if ENERGEST_CONF_ON
static unsigned long irq_energest = 0;
#define ENERGEST_IRQ_SAVE(a) do { \
    a = energest_type_time(ENERGEST_TYPE_IRQ); } while(0)
#define ENERGEST_IRQ_RESTORE(a) do { \
    energest_type_set(ENERGEST_TYPE_IRQ, a); } while(0)
#else
#define ENERGEST_IRQ_SAVE(a) do {} while(0)
#define ENERGEST_IRQ_RESTORE(a) do {} while(0)
#endif
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
void main(void)
{
  /* Hardware initialization */
  
  clock_init();
  //ctimer_init();
  //rtimer_init();

  
  /* Init LEDs here */
  //leds_init();
  //leds_off(LEDS_ALL);
  
  /* initialize process manager. */
  process_init();
  /* start services */
  process_start(&etimer_process, NULL);
  //ctimer_init();
  process_start(&sensors_process, NULL);
  BUTTON_SENSOR_ACTIVATE();
  //ADC_SENSOR_ACTIVATE();
  
  energest_init();
  ENERGEST_ON(ENERGEST_TYPE_CPU);

  autostart_start(autostart_processes);

  //watchdog_start();
   IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);//启动寄存器读写
   IWDG_SetPrescaler(IWDG_Prescaler_256);//40K时钟32分频
   IWDG_SetReload(255);                 //计数器数值
   IWDG_ReloadCounter();             //重启计数器
   IWDG_Enable();                       //启动看门狗
  /* Infinite loop */
  while (1)
  {
    uint8_t r;
    do {
      /* Reset watchdog and handle polls and events */
      //watchdog_periodic();

      r = process_run();
    } while(r > 0);
    
    ENERGEST_OFF(ENERGEST_TYPE_CPU);
    ENERGEST_ON(ENERGEST_TYPE_LPM);

    /* We are only interested in IRQ energest while idle or in LPM */
    ENERGEST_IRQ_RESTORE(irq_energest);
    IWDG_ReloadCounter();//重启计数器（喂狗）
    __wait_for_interrupt();
    /* Remember energest IRQ for next pass */
    ENERGEST_IRQ_SAVE(irq_energest);

    ENERGEST_ON(ENERGEST_TYPE_CPU);
    ENERGEST_OFF(ENERGEST_TYPE_LPM);
  }
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
